app/controllers/books_controller.rb

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["body", ""], ["created_at", "2021-07-18 00:10:58.897698"], ["updated_at", "2021-07-18 00:10:58.897698"]]
---
  def create
    @books = Book.all
    @book = Book.new(book_params)
    @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 69], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "テストs"], ["updated_at", "2021-07-18 08:40:36.502470"], ["id", 46]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "ss"], ["body", "ssss"], ["updated_at", "2021-07-17 14:02:19.082002"], ["id", 55]]
---
  def update
    @book = Book.find(params[:id])
    @book.update(book_params)
      if @book.update(book_params)